In [15]:
import pandas as pd
from random import choice 
from random import randint 
import os

In [16]:
female_names_df = pd.read_csv("FemaleNames.csv")
male_names_df = pd.read_csv("MaleNames.csv")
positions_df = pd.read_csv("Positions.csv")
surnames_df = pd.read_csv("Surnames.csv")

In [17]:
NUMBER_OF_ROWS_TO_BE_GENERATED = 100_000
SAVE_FILE_NAME = f"Generated_Dataset_{NUMBER_OF_ROWS_TO_BE_GENERATED}.csv"
WRITE_FILE = True
UNIQUE_SALARY = False # Will make sure that all of the salaries in the rows would be unique
MAX_SALARY = 1_000_000
MIN_SALARY = 100_000
SALARY_STEP = 10_000

In [18]:
fn_list = female_names_df["Name"].values.tolist()
mn_list = male_names_df["Name"].values.tolist()
pos_list = positions_df["Position"].values.tolist()
sur_list = surnames_df["Surname"].values.tolist()
gender = ["Male", "Female"]

In [19]:
fn_list = [x.title() for x in fn_list]
mn_list = [x.title() for x in mn_list]
pos_list = [x.upper() for x in pos_list]
sur_list = [x.title() for x in sur_list]
gender = [x.title() for x in gender]

In [20]:
salary_list = []
counter = 0
for _ in range(NUMBER_OF_ROWS_TO_BE_GENERATED):
    if UNIQUE_SALARY:
        while True:
            sal = randint(MIN_SALARY, MAX_SALARY, SALARY_STEP)
            print(f"{counter} {sal}")
            if sal not in salary_list:
                salary_list.append(sal)
                break 
    else:        
        sal = randint(MIN_SALARY / SALARY_STEP , MAX_SALARY / SALARY_STEP) * SALARY_STEP
        salary_list.append(sal)

    counter += 1

In [21]:
dataset = {
    "First Name" : [],
    "Last Name" : [],
    "Positions" : [],
    "Gender" : [],
    "Salary" : salary_list
}

for _ in range(NUMBER_OF_ROWS_TO_BE_GENERATED):
    if (randint(0, 1) == 0):
        dataset["Gender"].append(gender[0])
        dataset["First Name"].append(choice(mn_list))
    else:
        dataset["Gender"].append(gender[1])
        dataset["First Name"].append(choice(fn_list))

    dataset["Positions"].append(choice(pos_list))
    dataset["Last Name"].append(choice(sur_list))

In [22]:
for x in dataset:
    print(f"{x} : {len(dataset[x])}")

First Name : 100000
Last Name : 100000
Positions : 100000
Gender : 100000
Salary : 100000

In [23]:
output_df = pd.DataFrame(dataset)
output_df.head()

   First Name  Last Name                      Positions  Gender  Salary
0    Angeline  Caballero                FINANCE MANAGER  Female  920000
1   Christine  Dela Cruz  CHIEF EXECUTIVE OFFICER (CEO)  Female  120000
2     Janelle   Soberano       ADMINISTRATIVE ASSISTANT  Female  100000
3        Kyla       Juan  CHIEF MARKETING OFFICER (CMO)  Female  800000
4  John Lloyd    Alarcon           SALES REPRESENTATIVE    Male  330000

In [24]:
output_df.to_csv(SAVE_FILE_NAME)